Revit 2027 API
BuiltInFailures.FamilyFailures.FamilyConnectorDeletedWarning Property
 The family Connector has been modified so the connection is invalid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FamilyConnectorDeletedWarning { get; }
Public Shared ReadOnly Property FamilyConnectorDeletedWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FamilyConnectorDeletedWarning {
	FailureDefinitionId^ get ();
}
static member FamilyConnectorDeletedWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace